# ETL Project

### New Film Project

Our group has decided to make a new film. But before we commit to a new project, we will gather data on past succesful films. We will look at starting budgets, gross revenue, genres and other relevant information displayed below in our panda data frames and postgres tables later on.

### Extract

All our data was found on website [Kaggle](https://www.Kaggle.com) in CSV format. 

These are the direct links:

[Blockbuster CSV ](https://www.kaggle.com/bidyutchanda/top-10-highest-grossing-films-19752018) <br><br>
[IMDB CSV](https://www.kaggle.com/PromptCloudHQ/imdb-data)<br><br>
[TMBD CSV](https://www.kaggle.com/tmdb/tmdb-movie-metadata)

### Transform

After downloading our, data we used a Jupyter Notebook to import the CSVs and created data frames using the Pandas library.
<br>
<br>
Once they were Panda data frames form we did the following to clean and transform our data to make it useful:
<br>
* Drop columns we found irrelevant or were duplicates <br>
* Renamed columns to make it look cleaner and match columns on postgres <br>
* We dropped any possible duplicate records from our tables <br>
* Set an index for each of our data frames <br>
* Changed data type on certain columns to be able able to import onto postgres database tables <br>

### Load

After cleaning our data, we imported all data frames onto postres database tables. Once on postress, we were able to run queries to find useful information like:
<br>
* Top 10 highest earning films <br>
* Genre with the highest earnings <br>
* Directors who made top films <br>
* Return on films <br>
* Studios with the higest revenue

We chose postgres because it is a platform we are more familiar with in regard to manipulating tables (joining, primary keys, etc.)

In [78]:
import pandas as pd
from sqlalchemy import create_engine

# Blockbuster DF

In [79]:
# import csv
blockbuster_csv = '../../../resources/hw_resources/11-ETL-Project-Resources/blockbusters.csv'
blockbuster_df = pd.read_csv(blockbuster_csv)
blockbuster_df.head()

,Main_Genre,Genre_2,Genre_3,imdb_rating,length,rank_in_year,rating,studio,title,worldwide_gross,year
0,Action,Adventure,Drama,7.4,135,1,PG-13,Walt Disney Pictures,Black Panther,"$700,059,566",2018
1,Action,Adventure,Sci-Fi,8.5,156,2,PG-13,Walt Disney Pictures,Avengers: Infinity War,"$678,815,482",2018
2,Animation,Action,Adventure,7.8,118,3,PG,Pixar,Incredibles 2,"$608,581,744",2018
3,Action,Adventure,Drama,6.2,129,4,PG-13,Universal Pictures,Jurassic World: Fallen Kingdom,"$416,769,345",2018
4,Action,Comedy,NaN,7.8,119,5,R,20th Century Fox,Deadpool 2,"$318,491,426",2018

In [80]:
# Transform Data
# Rename columns
new_blockbuster_df = blockbuster_df[['title',
                                     'Main_Genre',
                                     'rating',
                                     'year',
                                     'studio',
                                     'worldwide_gross']]

new_blockbuster_df = new_blockbuster_df.rename(columns={'title':'title',
                                                        'Main_Genre':'genre',
                                                        'rating':'rating',
                                                        'year':'release_year',
                                                        'studio':'studio',
                                                        'worldwide_gross':'worldwide_gross'})
# Drop duplicates, set_index
new_blockbuster_df.drop_duplicates('title', inplace = True)
new_blockbuster_df.set_index('title', inplace=True)
new_blockbuster_df.head()

,genre,rating,release_year,studio,worldwide_gross
title,,,,,
Black Panther,Action,PG-13,2018,Walt Disney Pictures,"$700,059,566"
Avengers: Infinity War,Action,PG-13,2018,Walt Disney Pictures,"$678,815,482"
Incredibles 2,Animation,PG,2018,Pixar,"$608,581,744"
Jurassic World: Fallen Kingdom,Action,PG-13,2018,Universal Pictures,"$416,769,345"
Deadpool 2,Action,R,2018,20th Century Fox,"$318,491,426"

In [81]:
new_blockbuster_df.dtypes

genre              object
rating             object
release_year        int64
studio             object
worldwide_gross    object
dtype: object

In [82]:
# change data types to be able to import onto postgres
new_blockbuster_df['worldwide_gross'] = (new_blockbuster_df['worldwide_gross']
                                         .replace( '[\$,)]','', regex=True )
                                         .replace( '[(]','-',   regex=True ).astype(float))

In [83]:
new_blockbuster_df.dtypes

genre               object
rating              object
release_year         int64
studio              object
worldwide_gross    float64
dtype: object

In [84]:
new_blockbuster_df.head()

,genre,rating,release_year,studio,worldwide_gross
title,,,,,
Black Panther,Action,PG-13,2018,Walt Disney Pictures,700059566.0
Avengers: Infinity War,Action,PG-13,2018,Walt Disney Pictures,678815482.0
Incredibles 2,Animation,PG,2018,Pixar,608581744.0
Jurassic World: Fallen Kingdom,Action,PG-13,2018,Universal Pictures,416769345.0
Deadpool 2,Action,R,2018,20th Century Fox,318491426.0

# creating a connection

In [85]:
# import csv
rds_connection_string = "postgres:@localhost:5433/movies_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [86]:
engine.table_names()

['blockbuster', 'imdb', 'tmdb']

In [87]:
new_blockbuster_df.to_sql(name = 'blockbuster', 
                          con = engine,
                          if_exists = 'append',
                          index = True)

In [88]:
pd.read_sql_query('SELECT * FROM blockbuster', con = engine).head()

,title,genre,rating,release_year,studio,worldwide_gross
0,Black Panther,Action,PG-13,2018,Walt Disney Pictures,700059566.0
1,Avengers: Infinity War,Action,PG-13,2018,Walt Disney Pictures,678815482.0
2,Incredibles 2,Animation,PG,2018,Pixar,608581744.0
3,Jurassic World: Fallen Kingdom,Action,PG-13,2018,Universal Pictures,416769345.0
4,Deadpool 2,Action,R,2018,20th Century Fox,318491426.0

# imdb

In [89]:

imdb_csv = '../../../resources/hw_resources/11-ETL-Project-Resources/IMDB-Movie-Data.csv'
imdb_df = pd.read_csv(imdb_csv)
imdb_df.head()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [90]:
# Transform Data
# Rename columns
new_imdb_df = imdb_df[['Title', 'Director', 'Actors', 'Rating',
                       'Votes','Revenue (Millions)','Metascore']]

new_imdb_df = new_imdb_df.rename(columns={'Title':'title', 'Director':'director',
                                     'Actors':'actors','Rating':'rating',
                                     'Votes':'votes',
                                     'Revenue (Millions)':'revenue_millions',
                                     'Metascore':'metascore'})

# Drop duplicates, set_index
new_imdb_df.drop_duplicates('title', inplace = True)
new_imdb_df.set_index('title', inplace = True)
new_imdb_df.head()

,director,actors,rating,votes,revenue_millions,metascore
title,,,,,,
Guardians of the Galaxy,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",8.1,757074,333.13,76.0
Prometheus,Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",7.0,485820,126.46,65.0
Split,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",7.3,157606,138.12,62.0
Sing,Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",7.2,60545,270.32,59.0
Suicide Squad,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",6.2,393727,325.02,40.0

In [91]:
new_imdb_df.dtypes

director             object
actors               object
rating              float64
votes                 int64
revenue_millions    float64
metascore           float64
dtype: object

In [92]:
engine.table_names()

['blockbuster', 'imdb', 'tmdb']

In [93]:
new_imdb_df.to_sql(name = 'imdb', 
                          con = engine,
                          if_exists = 'append',
                          index = True)

In [94]:
pd.read_sql_query('SELECT * FROM imdb', con = engine).head()

,title,director,actors,rating,votes,revenue_millions,metascore
0,Guardians of the Galaxy,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",8.1,757074,333.13,76.0
1,Prometheus,Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",7.0,485820,126.46,65.0
2,Split,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",7.3,157606,138.12,62.0
3,Sing,Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",7.2,60545,270.32,59.0
4,Suicide Squad,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",6.2,393727,325.02,40.0

# tmdb

In [95]:

tmdb_csv = '../../../resources/hw_resources/11-ETL-Project-Resources/tmdb_5000_movies.csv'
tmdb_df = pd.read_csv(tmdb_csv)

In [96]:
new_tmdb_df = tmdb_df[['title','original_title','budget',]]

new_tmdb_df.drop_duplicates('title', inplace = True)
new_tmdb_df.set_index('title', inplace = True)
new_tmdb_df.head()

C:\Users\ucibc\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

,original_title,budget
title,,
Avatar,Avatar,237000000
Pirates of the Caribbean: At World's End,Pirates of the Caribbean: At World's End,300000000
Spectre,Spectre,245000000
The Dark Knight Rises,The Dark Knight Rises,250000000
John Carter,John Carter,260000000

In [97]:
new_tmdb_df.dtypes

original_title    object
budget             int64
dtype: object

In [98]:
engine.table_names()

['blockbuster', 'imdb', 'tmdb']

In [99]:
new_tmdb_df.to_sql(name = 'tmdb', 
                          con = engine,
                          if_exists = 'append',
                          index = True)

In [100]:
pd.read_sql_query('SELECT * FROM tmdb', con = engine).head()

,title,original_title,budget
0,Avatar,Avatar,237000000
1,Pirates of the Caribbean: At World's End,Pirates of the Caribbean: At World's End,300000000
2,Spectre,Spectre,245000000
3,The Dark Knight Rises,The Dark Knight Rises,250000000
4,John Carter,John Carter,260000000